{
  "type": "UploadedFiles",
  "managed": false,
  "featureGroup": false,
  "formatType": "csv",
  "checklists": {
    "checklists": []
  },
  "checks": [],
  "customMeta": {
    "kv": {}
  },
  "flowOptions": {
    "virtualizable": false,
    "rebuildBehavior": "NORMAL",
    "crossProjectBuildBehavior": "DEFAULT"
  },
  "readWriteOptions": {
    "preserveOrder": false,
    "writeBuckets": 1,
    "forceSingleOutputFile": false,
    "defaultReadOrdering": {
      "enabled": false,
      "rules": []
    }
  },
  "formatParams": {
    "style": "excel",
    "charset": "utf-8",
    "separator": " ",
    "quoteChar": "\"",
    "escapeChar": "\\",
    "maxRowChars": 100000000,
    "dateSerializationFormat": "ISO",
    "arrayMapFormat": "json",
    "hiveSeparators": [
      "\u0002",
      "\u0003",
      "\u0004",
      "\u0005",
      "\u0006",
      "\u0007",
      "\b"
    ],
    "skipRowsBeforeHeader": 1,
    "parseHeaderRow": true,
    "skipRowsAfterHeader": 0,
    "probableNumberOfRecords": 13,
    "normalizeBooleans": false,
    "normalizeDoubles": true,
    "readAdditionalColumnsBehavior": "INSERT_IN_DATA_WARNING",
    "readMissingColumnsBehavior": "DISCARD_SILENT",
    "readDataTypeMismatchBehavior": "DISCARD_WARNING",
    "writeDataTypeMismatchBehavior": "DISCARD_WARNING",
    "fileReadFailureBehavior": "FAIL",
    "compress": ""
  },
  "partitioning": {
    "ignoreNonMatchingFile": false,
    "considerMissingRequestedPartitionsAsEmpty": false,
    "dimensions": []
  },
  "creationTag": {
    "versionNumber": 0,
    "lastModifiedBy": {
      "login": "pierrepetrella"
    },
    "lastModifiedOn": 1728478930835,
    "extendedProperties": {}
  },
  "tags": [],
  "params": {
    "uploadConnection": "Default (in DSS data dir.)",
    "notReadyIfEmpty": false,
    "filesSelectionRules": {
      "mode": "ALL",
      "excludeRules": [],
      "includeRules": [],
      "explicitFiles": []
    },
    "variablesExpansionLoopConfig": {
      "enabled": false,
      "mode": "CREATE_VARIABLE_FOR_EACH_COLUMN",
      "replacements": []
    }
  },
  "schema": {
    "columns": [
      {"name":"Justin","type":"string"},
      {"name":"Lee,8.3K,11,https://medium.com/swlh/chatbots-were-the-next-big-thing-what-happened-5fc49dd6fa61?source\u003d---------0----------------,Chatbots","type":"string"},
      {"name":"were","type":"string"},
      {"name":"the","type":"string"},
      {"name":"next","type":"string"},
      {"name":"big","type":"string"},
      {"name":"thing:","type":"string"},
      {"name":"what","type":"string"},
      {"name":"happened?","type":"string"},
      {"name":"–","type":"string"},
      {"name":"The","type":"string"},
      {"name":"Startup","type":"string"},
      {"name":"–_2","type":"string"},
      {"name":"Medium,Oh, how the headlines blared:\nChatbots were The Next Big Thing.\nOur hopes were sky high. Bright-eyed and bushy-tailed, the industry was ripe for a new era of innovation: it was time to start socializing with machines.\nAnd why wouldn’t they be? All the road signs pointed towards insane success.\nAt the Mobile World Congress 2017, chatbots were the main headliners. The conference organizers cited an ‘overwhelming acceptance at the event of the inevitable shift of focus for brands and corporates to chatbots’.\nIn fact, the only significant question around chatbots was who would monopolize the field, not whether chatbots would take off in the first place:\nOne year on, we have an answer to that question.\nNo.\nBecause there isn’t even an ecosystem for a platform to dominate.\nChatbots weren’t the first technological development to be talked up in grandiose terms and then slump spectacularly.\nThe age-old hype cycle unfolded in familiar fashion...\nExpectations built, built, and then..... It all kind of fizzled out.\nThe predicted paradim shift didn’t materialize.\nAnd apps are, tellingly, still alive and well.\nWe look back at our breathless optimism and turn to each other, slightly baffled:\n“is that it? THAT was the chatbot revolution we were promised?”\nDigit’s Ethan Bloch sums up the general consensus:\nAccording to Dave Feldman, Vice President of Product Design at Heap, chatbots didn’t just take on one difficult problem and fail: they took on several and failed all of them.\nBots can interface with users in different ways. The big divide is text vs. speech. In the beginning (of computer interfaces) was the (written) word.\nUsers had to type commands manually into a machine to get anything done.\nThen, graphical user interfaces (GUIs) came along and saved the day. We became entranced by windows, mouse clicks, icons. And hey, we eventually got color, too!\nMeanwhile, a bunch of research scientists were busily developing natural language (NL) interfaces to databases, instead of having to learn an arcane database query language.\nAnother bunch of scientists were developing speech-processing software so that you could just speak to your computer, rather than having to type. This turned out to be a whole lot more difficult than anyone originally realised:\nThe next item on the agenda was holding a two-way dialog with a machine. Here’s an example dialog (dating back to the 1990s) with VCR setup system:\nPretty cool, right? The system takes turns in collaborative way, and does a smart job of figuring out what the user wants.\nIt was carefully crafted to deal with conversations involving VCRs, and could only operate within strict limitations.\nModern day bots, whether they use typed or spoken input, have to face all these challenges, but also work in an efficient and scalable way on a variety of platforms.\nBasically, we’re still trying to achieve the same innovations we were 30 years ago.\nHere’s where I think we’re going wrong:\nAn oversized assumption has been that apps are ‘over’, and would be replaced by bots.\nBy pitting two such disparate concepts against one another (instead of seeing them as separate entities designed to serve different purposes) we discouraged bot development.\nYou might remember a similar war cry when apps first came onto the scene ten years ago: but do you remember when apps replaced the internet?\nIt’s said that a new product or service needs to be two of the following: better, cheaper, or faster. Are chatbots cheaper or faster than apps? No — not yet, at least.\nWhether they’re ‘better’ is subjective, but I think it’s fair to say that today’s best bot isn’t comparable to today’s best app.\nPlus, nobody thinks that using Lyft is too complicated, or that it’s too hard to order food or buy a dress on an app. What is too complicated is trying to complete these tasks with a bot — and having the bot fail.\nA great bot can be about as useful as an average app. When it comes to rich, sophisticated, multi-layered apps, there’s no competition.\nThat’s because machines let us access vast and complex information systems, and the early graphical information systems were a revolutionary leap forward in helping us locate those systems.\nModern-day apps benefit from decades of research and experimentation. Why would we throw this away?\nBut, if we swap the word ‘replace’ with ‘extend’, things get much more interesting.\nToday’s most successful bot experiences take a hybrid approach, incorporating chat into a broader strategy that encompasses more traditional elements.\nThe next wave will be multimodal apps, where you can say what you want (like with Siri) and get back information as a map, text, or even a spoken response.\nAnother problematic aspect of the sweeping nature of hype is that it tends to bypass essential questions like these.\nFor plenty of companies, bots just aren’t the right solution. The past two years are littered with cases of bots being blindly applied to problems where they aren’t needed.\nBuilding a bot for the sake of it, letting it loose and hoping for the best will never end well:\nThe vast majority of bots are built using decision-tree logic, where the bot’s canned response relies on spotting specific keywords in the user input.\nThe advantage of this approach is that it’s pretty easy to list all the cases that they are designed to cover. And that’s precisely their disadvantage, too.\nThat’s because these bots are purely a reflection of the capability, fastidiousness and patience of the person who created them; and how many user needs and inputs they were able to anticipate.\nProblems arise when life refuses to fit into those boxes.\nAccording to recent reports, 70% of the 100,000+ bots on Facebook Messenger are failing to fulfil simple user requests. This is partly a result of developers failing to narrow their bot down to one strong area of focus.\nWhen we were building GrowthBot, we decided to make it specific to sales and marketers: not an ‘all-rounder’, despite the temptation to get overexcited about potential capabilties.\nRemember: a bot that does ONE thing well is infinitely more helpful than a bot that does multiple things poorly.\nA competent developer can build a basic bot in minutes — but one that can hold a conversation? That’s another story. Despite the constant hype around AI, we’re still a long way from achieving anything remotely human-like.\nIn an ideal world, the technology known as NLP (natural language processing) should allow a chatbot to understand the messages it receives. But NLP is only just emerging from research labs and is very much in its infancy.\nSome platforms provide a bit of NLP, but even the best is at toddler-level capacity (for example, think about Siri understanding your words, but not their meaning.)\nAs Matt Asay outlines, this results in another issue: failure to capture the attention and creativity of developers.\nAnd conversations are complex. They’re not linear. Topics spin around each other, take random turns, restart or abruptly finish.\nToday’s rule-based dialogue systems are too brittle to deal with this kind of unpredictability, and statistical approaches using machine learning are just as limited. The level of AI required for human-like conversation just isn’t available yet.\nAnd in the meantime, there are few high-quality examples of trailblazing bots to lead the way. As Dave Feldman remarked:\nOnce upon a time, the only way to interact with computers was by typing arcane commands to the terminal. Visual interfaces using windows, icons or a mouse were a revolution in how we manipulate information\nThere’s a reasons computing moved from text-based to graphical user interfaces (GUIs). On the input side, it’s easier and faster to click than it is to type.\nTapping or selecting is obviously preferable to typing out a whole sentence, even with predictive (often error-prone ) text. On the output side, the old adage that a picture is worth a thousand words is usually true.\nWe love optical displays of information because we are highly visual creatures. It’s no accident that kids love touch screens. The pioneers who dreamt up graphical interface were inspired by cognitive psychology, the study of how the brain deals with communication.\nConversational UIs are meant to replicate the way humans prefer to communicate, but they end up requiring extra cognitive effort. Essentially, we’re swapping something simple for a more-complex alternative.\nSure, there are some concepts that we can only express using language (“show me all the ways of getting to a museum that give me 2000 steps but don’t take longer than 35 minutes”), but most tasks can be carried out more efficiently and intuitively with GUIs than with a conversational UI.\nAiming for a human dimension in business interactions makes sense.\nIf there’s one thing that’s broken about sales and marketing, it’s the lack of humanity: brands hide behind ticket numbers, feedback forms, do-not-reply-emails, automated responses and gated ‘contact us’ forms.\nFacebook’s goal is that their bots should pass the so-called Turing Test, meaning you can’t tell whether you are talking to a bot or a human. But a bot isn’t the same as a human. It never will be.\nA conversation encompasses so much more than just text.\nHumans can read between the lines, leverage contextual information and understand double layers like sarcasm. Bots quickly forget what they’re talking about, meaning it’s a bit like conversing with someone who has little or no short-term memory.\nAs HubSpot team pinpointed:\nPeople aren’t easily fooled, and pretending a bot is a human is guaranteed to diminish returns (not to mention the fact that you’re lying to your users).\nAnd even those rare bots that are powered by state-of-the-art NLP, and excel at processing and producing content, will fall short in comparison.\nAnd here’s the other thing. Conversational UIs are built to replicate the way humans prefer to communicate — with other humans.\nBut is that how humans prefer to interact with machines?\nNot necessarily.\nAt the end of the day, no amount of witty quips or human-like mannerisms will save a bot from conversational failure.\nIn a way, those early-adopters weren’t entirely wrong.\nPeople are yelling at Google Home to play their favorite song, ordering pizza from the Domino’s bot and getting makeup tips from Sephora. But in terms of consumer response and developer involvement, chatbots haven’t lived up to the hype generated circa 2015/16.\nNot even close.\nComputers are good at being computers. Searching for data, crunching numbers, analyzing opinions and condensing that information.\nComputers aren’t good at understanding human emotion. The state of NLP means they still don’t ‘get’ what we’re asking them, never mind how we feel.\nThat’s why it’s still impossible to imagine effective customer support, sales or marketing without the essential human touch: empathy and emotional intelligence.\nFor now, bots can continue to help us with automated, repetitive, low-level tasks and queries; as cogs in a larger, more complex system. And we did them, and ourselves, a disservice by expecting so much, so soon.\nBut that’s not the whole story.\nYes, our industry massively overestimated the initial impact chatbots would have. Emphasis on initial.\nAs Bill Gates once said:\nThe hype is over. And that’s a good thing. Now, we can start examining the middle-grounded grey area, instead of the hyper-inflated, frantic black and white zone.\nI believe we’re at the very beginning of explosive growth. This sense of anti-climax is completely normal for transformational technology.\nMessaging will continue to gain traction. Chatbots aren’t going away. NLP and AI are becoming more sophisticated every day.\nDevelopers, apps and platforms will continue to experiment with, and heavily invest in, conversational marketing.\nAnd I can’t wait to see what happens next.\nFrom a quick cheer to a standing ovation, clap to show how much you enjoyed this story.\nHead of Growth for GrowthBot, Messaging \u0026 Conversational Strategy @HubSpot\nMedium\u0027s largest publication for makers. Subscribe to receive our top stories here → https://goo.gl/zHcLJi","type":"string"},
      {"name":"col_14","type":"string"},
      {"name":"col_15","type":"string"},
      {"name":"col_16","type":"string"},
      {"name":"col_17","type":"string"},
      {"name":"col_18","type":"string"},
      {"name":"col_19","type":"string"},
      {"name":"col_20","type":"string"}
    ],
    "userModified": true
  },
  "dkuProperties": [],
  "metrics": {
    "probes": [
      {
        "type": "basic",
        "enabled": true,
        "computeOnBuildMode": "PARTITION",
        "meta": {
          "name": "Basic data",
          "level": 0
        },
        "configuration": {}
      },
      {
        "type": "records",
        "enabled": true,
        "computeOnBuildMode": "NO",
        "meta": {
          "name": "Record count",
          "level": 0
        },
        "configuration": {}
      }
    ],
    "engineConfig": {
      "padRunsWithMetrics": false,
      "hive": {
        "active": true,
        "extraConf": []
      },
      "basic": {},
      "dss": {
        "active": true,
        "selection": {
          "useMemTable": false,
          "filter": {
            "distinct": false,
            "enabled": false
          },
          "partitionSelectionMethod": "ALL",
          "latestPartitionsN": 1,
          "ordering": {
            "enabled": false,
            "rules": []
          },
          "samplingMethod": "FULL",
          "maxRecords": -1,
          "targetRatio": 0.02,
          "ascending": true,
          "withinFirstN": -1,
          "maxReadUncompressedBytes": -1
        }
      },
      "sql": {
        "active": true
      },
      "impala": {
        "active": true
      },
      "spark": {
        "active": true,
        "extraConf": []
      },
      "python": {}
    },
    "displayedState": {
      "columns": [],
      "metrics": [
        "basic:COUNT_COLUMNS",
        "basic:COUNT_FILES",
        "basic:SIZE",
        "records:COUNT_RECORDS"
      ]
    }
  },
  "metricsChecks": {
    "monitor": false,
    "checks": [],
    "displayedState": {
      "checks": []
    }
  },
  "customFields": {}
}